tap "hashicorp/tap"
tap "jae-labs/formulae"
tap "localstack/tap"
tap "unikraft/cli"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU Binutils for aarch64-elf cross development
brew "aarch64-elf-binutils"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection for aarch64-elf
brew "aarch64-elf-gcc"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Heavily optimized DEFLATE/zlib/gzip compression and decompression
brew "libdeflate"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Open-source implementation of JPEG2000 Part-15 (or JPH or HTJ2K)
brew "openjph"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Record and share terminal sessions
brew "asciinema"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Collection of portable C++ source libraries
brew "boost"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# HTTP/2 C Library
brew "libnghttp2"
# HTTP/3 library written in C
brew "libnghttp3"
# IETF QUIC protocol implementation
brew "libngtcp2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Message bus system, providing inter-application communication
brew "dbus"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Device tree compiler
brew "dtc"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# GNU awk utility
brew "gawk"
# Library for encoding and decoding .avif files
brew "libavif"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# OpenGL Extension Wrangler Library
brew "glew"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Secure hashing function
brew "libb2"
# Numeric library for complex error functions
brew "libcerf"
# Powerful, lightweight programming language
brew "lua"
# C Markdown parser. Fast. SAX-like interface
brew "md4c"
# Framework for layout and rendering of i18n text
brew "pango"
# Cross-platform application and UI framework
brew "qtbase"
# Classes for displaying the contents of SVG files
brew "qtsvg"
# QML, Qt Quick and several related modules
brew "qtdeclarative"
# Provides tools for the cross-platform Qt shader pipeline
brew "qtshadertools"
# Qt 5 Core APIs that were removed in Qt 6
brew "qt5compat"
# Command-driven, interactive function plotting
brew "gnuplot"
# Stricter gofmt
brew "gofumpt"
# Go formatter that additionally inserts import statements
brew "goimports"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# JSON parser and validator with a CLI
brew "jsonlint"
# Network authentication protocol
brew "krb5"
# Colorize your kubectl output
brew "kubecolor"
# CBOR protocol implementation for C and others
brew "libcbor"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library for large linear classification
brew "liblinear"
# Portable library for network traffic capture
brew "libpcap"
# Postgres C API library
brew "libpq"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Web server access log visualizer with retro style
brew "logstalgia"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Nice to use pager for humans
brew "moor"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Port scanning utility for large networks
brew "nmap"
# Shell command parallelization utility
brew "parallel"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Object-relational database system
brew "postgresql@14"
# Compression/decompression library aiming for high speed
brew "snappy"
# Ethernet compliant virtual network
brew "vde"
# Generic machine emulator and virtualizer
brew "qemu"
# Tool for securing CI/CD workflows with version pinning
brew "ratchet"
# Persistent key-value database, with built-in net interface
brew "redis"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# SOcket CAT: netcat on steroids
brew "socat"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# GNU Binutils for x86_64-elf cross development
brew "x86_64-elf-binutils"
# GNU compiler collection for x86_64-elf
brew "x86_64-elf-gcc"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Cards Against the Void - AI-powered flashcards CLI
brew "jae-labs/formulae/catv"
# Build and use highly customized and ultra-lightweight unikernels.
brew "unikraft/cli/kraftkit"
# Enable Windows-like alt-tab
cask "alt-tab"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Utility to hide menu bar items
cask "hiddenbar"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
